Attribute VB_Name = "Module2"
Option Explicit

' -------------------------------------------------
'Должность       |Кол-во    | Зп, до вычета НФДЛ
' -------------------------------------------------
'Кассир           1           40000
'Кладовщик        2           50000
'Продавец         5           70000


Sub Урок5()

'   Dim a%, b%, c%
'   Dim X%
    
    a = 1
    b = 2
    c = 5
    
    X = a * 40000 + b * 50000 + c * 70000
    
    'ФОТ за месяц
    MsgBox "ФОТ за месяц: " & X
    
    'ФОТ за год
    MsgBox "ФОТ за год: " & X * 12
    
    'НДФЛ за год
    MsgBox "НДФЛ за год: " & X * 12 * 0.13
    
    'Кол-во сотрудников
    MsgBox "Кол-во сотрудников: " & a + b + c
    
End Sub
